# ASR 热词参考 - 程序员面试场景
#
# 将这些热词添加到阿里云百炼平台的热词表中，然后将热词表ID填入 application-dev.yml 的
# spring.ai.dashscope.asr.vocabulary-id 配置项。
#
# 热词表创建方式：https://help.aliyun.com/zh/model-studio/custom-hot-words/
#
# 每行一个热词，支持中文、英文和中英混合。热词权重默认为中等，也可以指定权重（1-5，5最高）。
# 格式：热词 权重（空格分隔，权重可省略）

# ===== 编程语言 & 框架 =====
Java
Spring Boot
Spring Cloud
MyBatis
MyBatis-Plus
Hibernate
JPA
Netty
Dubbo
gRPC
Kotlin
Scala
Python
Django
Flask
FastAPI
Golang
Go语言
Rust
C++
C语言
TypeScript
JavaScript
Node.js
React
Vue
Angular
Next.js
Nuxt
Svelte
jQuery

# ===== 数据库 =====
MySQL
PostgreSQL
MongoDB
Redis
Memcached
Elasticsearch
ClickHouse
TiDB
HBase
Cassandra
Neo4j
SQLite
Oracle

# ===== 中间件 & 基础设施 =====
Kafka
RabbitMQ
RocketMQ
Nginx
Tomcat
Docker
Kubernetes
K8s
Jenkins
GitLab
Prometheus
Grafana
Zookeeper
Consul
Nacos
Sentinel
Envoy
HAProxy

# ===== 云服务 & DevOps =====
AWS
Azure
阿里云
腾讯云
华为云
CI/CD
DevOps
Terraform
Ansible
Helm
Istio

# ===== 计算机基础术语 =====
TCP
UDP
HTTP
HTTPS
HTTP2
WebSocket
RESTful
RPC
CDN
DNS
IP
MAC地址
CPU
GPU
RAM
SSD
HDD

# ===== 设计模式 & 架构 =====
单例模式
工厂模式
观察者模式
策略模式
装饰器模式
代理模式
MVC
MVVM
微服务
单体架构
领域驱动设计
DDD
CQRS
事件驱动
SOA
六边形架构

# ===== 算法 & 数据结构 =====
二叉树
红黑树
B树
B+树
哈希表
跳表
布隆过滤器
LRU
LFU
动态规划
贪心算法
回溯算法
分治算法
快速排序
归并排序
堆排序
时间复杂度
空间复杂度
Big-O

# ===== Java 特有术语 =====
JVM
JDK
JRE
GC
垃圾回收
OOM
OutOfMemory
堆内存
栈内存
方法区
元空间
类加载
双亲委派
CAS
AQS
ThreadLocal
线程池
锁升级
偏向锁
轻量级锁
重量级锁
synchronized
volatile
ReentrantLock
ConcurrentHashMap
HashMap
ArrayList
LinkedList
强引用
软引用
弱引用
虚引用
JIT
即时编译
字节码
泛型
反射
注解
SPI
序列化
反序列化
NIO
BIO
AIO
Netty

# ===== 分布式 & 高并发 =====
分布式锁
分布式事务
CAP定理
BASE理论
一致性哈希
 Raft协议
Paxos协议
主从复制
读写分离
分库分表
限流
熔断
降级
雪崩效应
缓存穿透
缓存击穿
缓存雪崩
幂等性
补偿事务
TCC
SAGA
两阶段提交
2PC
3PC
消息队列
削峰填谷

# ===== 安全 =====
OAuth2
JWT
RBAC
ABAC
XSS
CSRF
SQL注入
HTTPS
TLS
SSL
对称加密
非对称加密
RSA
AES
MD5
SHA256

# ===== 测试 =====
JUnit
Mockito
单元测试
集成测试
TDD
BDD
压力测试
基准测试
JMeter
覆盖率

# ===== 大数据 & AI =====
Hadoop
Spark
Flink
Hive
Presto
Airflow
PyTorch
TensorFlow
LangChain
RAG
向量数据库
Embedding
微调
Fine-tuning
Prompt
Token
Transformer
Attention
大语言模型
LLM
